spec/web_mock/stripe_card_charge.json

 {
  "id": "ch_14rwFr2eZvKYlo2C2GQNHeym",
  "object": "charge",
  "created": 1414350043,
  "livemode": false,
  "paid": true,
  "amount": 1000,
  "currency": "usd",
  "refunded": false,
  "card": {
    "id": "card123",
    "object": "card",
    "last4": "4242",
    "brand": "Visa",
    "funding": "credit",
    "exp_month": 1,
    "exp_year": 2050,
    "fingerprint": "Xt5EWLLDS7FJjR1c",
    "country": "US",
    "name": null,
    "address_line1": null,
    "address_line2": null,
    "address_city": null,
    "address_state": null,
    "address_zip": null,
    "address_country": null,
    "cvc_check": "pass",
    "address_line1_check": null,
    "address_zip_check": null,
    "dynamic_last4": null,
    "customer": null
  },
  "captured": true,
  "refunds": {
    "object": "list",
    "total_count": 0,
    "has_more": false,
    "url": "/v1/charges/ch_14rwFr2eZvKYlo2C2GQNHeym/refunds",
    "data": [

    ]
  },
  "balance_transaction": "txn_14phmw2eZvKYlo2Cqq0lRW2N",
  "failure_message": null,
  "failure_code": null,
  "amount_refunded": 0,
  "customer": null,
  "invoice": null,
  "description": "Test charge",
  "dispute": null,
  "metadata": {
  },
  "statement_description": null,
  "receipt_email": null,
  "receipt_number": null,
  "shipping": null
}
