spec/web_mock/stripe_customer.json

{
  "object": "customer",
  "created": 1411485884,
  "id": "cus_4paKHGMWyPEkmv",
  "livemode": false,
  "description": "jane+clegault@gmail.com",
  "email": null,
  "delinquent": false,
  "metadata": {
  },
  "subscriptions": {
    "object": "list",
    "total_count": 0,
    "has_more": false,
    "url": "/v1/customers/cus_4paKHGMWyPEkmv/subscriptions",
    "data": [

    ]
  },
  "discount": null,
  "account_balance": 0,
  "currency": "usd",
  "cards": {
    "object": "list",
    "total_count": 1,
    "has_more": false,
    "url": "/v1/customers/cus_4paKHGMWyPEkmv/cards",
    "data": [
      {
        "id": "card123",
        "object": "card",
        "last4": "4242",
        "brand": "Visa",
        "funding": "credit",
        "exp_month": 1,
        "exp_year": 2016,
        "fingerprint": "Xt5EWLLDS7FJjR1c",
        "country": "US",
        "name": "jane+clegault@gmail.com",
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": "pass",
        "address_line1_check": null,
        "address_zip_check": null,
        "customer": "cus_4paKHGMWyPEkmv"
      }
    ]
  },
  "default_card": "card_14fv9h2eZvKYlo2ChLQb4EJC"
}
